# Создайте новый класс Buiding с атрибутом total
# Создайте инициализатор для класса Buiding, который будет увеличивать атрибут количества созданных объектов
# класса Building total (по примеру класса Lemming из урока)
# В цикле создайте 40 объектов класса Building и выведите их на экран командой print

class Building:
    def __init__(self):
        self.total = 40

    def Building_total(self):
        print(self.total)


building = Building()
# print()
